const topoJson = {
    "nodes": [{
            "name": "核心路由器",
            "type": "6",
            "id": 1,
            "x": "0",
            "y": "0",
            "z": "0",
            "children": [{
                    "name": "普通路由器",
                    "type": "10",
                    "id": 2,
                    "x": "-280",
                    "y": "0",
                    "z": "0",
                    "children": [{
                            "name": "拟态DNS服务器",
                            "type": "3",
                            "id": 3,
                            "x": "-680",
                            "y": "0",
                            "z": "-108",
                            "children": []
                        },
                        {
                            "name": "拟态WEB服务器",
                            "type": "5",
                            "id": 4,
                            "x": "-550",
                            "y": "0",
                            "z": "-108",
                            "children": []
                        },
                        {
                            "name": "拟态文件存储服务器",
                            "type": "4",
                            "id": 5,
                            "x": "-420",
                            "y": "0",
                            "z": "-108",
                            "children": []
                        },
                        {
                            "name": "拟态虚拟主机",
                            "type": "8",
                            "id": 6,
                            "x": "-680",
                            "y": "0",
                            "z": "108",
                            "children": []
                        },
                        {
                            "name": "拟态防火墙",
                            "type": "2",
                            "id": 7,
                            "x": "-550",
                            "y": "0",
                            "z": "108",
                            "children": []
                        },
                        {
                            "name": "拟态路由器",
                            "type": "7",
                            "id": 8,
                            "x": "-420",
                            "y": "0",
                            "z": "108",
                            "children": []
                        }
                    ]
                },
                {
                    "name": "普通路由器",
                    "type": "10",
                    "id": 9,
                    "x": "280",
                    "y": "0",
                    "z": "0",
                    "children": [{
                            "name": "拟态WEB服务器",
                            "type": "5",
                            "id": 10,
                            "x": "450",
                            "y": "0",
                            "z": "-108",
                            "children": []
                        },
                        {
                            "name": "拟态文件存储服务器",
                            "type": "4",
                            "id": 11,
                            "x": "655",
                            "y": "0",
                            "z": "-108",
                            "children": []
                        },
                        {
                            "name": "拟态DNS服务器",
                            "type": "3",
                            "id": 12,
                            "x": "450",
                            "y": "0",
                            "z": "108",
                            "children": []
                        },
                        {
                            "name": "拟态路由器",
                            "type": "7",
                            "id": 13,
                            "x": "655",
                            "y": "0",
                            "z": "108",
                            "children": []
                        }
                    ]
                },
                {
                    "name": "普通路由器",
                    "type": "10",
                    "id": 14,
                    "x": "0",
                    "y": "0",
                    "z": "147",
                    "children": [{
                            "name": "交换机",
                            "type": "9",
                            "id": 15,
                            "x": "63",
                            "y": "0",
                            "z": "592",
                            "children": [{
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 16,
                                    "x": 23,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 17,
                                    "x": 48,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 18,
                                    "x": 73,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 19,
                                    "x": 98,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                }
                            ]
                        },
                        {
                            "name": "交换机",
                            "type": "9",
                            "id": 20,
                            "x": "189",
                            "y": "0",
                            "z": "592",
                            "children": [{
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 21,
                                    "x": 149,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 22,
                                    "x": 174,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 23,
                                    "x": 199,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 24,
                                    "x": 224,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                }
                            ]
                        },
                        {
                            "name": "交换机",
                            "type": "9",
                            "id": 25,
                            "x": "441",
                            "y": "0",
                            "z": "592",
                            "children": [{
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 26,
                                    "x": 401,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 27,
                                    "x": 426,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 28,
                                    "x": 451,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 29,
                                    "x": 476,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                }
                            ]
                        },
                        {
                            "name": "交换机",
                            "type": "9",
                            "id": 30,
                            "x": "315",
                            "y": "0",
                            "z": "592",
                            "children": [{
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 31,
                                    "x": 275,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 32,
                                    "x": 300,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 33,
                                    "x": 325,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 34,
                                    "x": 350,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                }
                            ]
                        },
                        {
                            "name": "交换机",
                            "type": "9",
                            "id": 35,
                            "x": "567",
                            "y": "0",
                            "z": "592",
                            "children": [{
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 36,
                                    "x": 527,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 37,
                                    "x": 552,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 38,
                                    "x": 577,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 39,
                                    "x": 602,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                }
                            ]
                        },
                        {
                            "name": "交换机",
                            "type": "9",
                            "id": 40,
                            "x": "693",
                            "y": "0",
                            "z": "592",
                            "children": [{
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 41,
                                    "x": 653,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 42,
                                    "x": 678,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 43,
                                    "x": 703,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 44,
                                    "x": 728,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                }
                            ]
                        },
                        {
                            "name": "交换机",
                            "type": "9",
                            "id": 45,
                            "x": "819",
                            "y": "0",
                            "z": "592",
                            "children": [{
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 46,
                                    "x": 779,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 47,
                                    "x": 804,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 48,
                                    "x": 829,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 49,
                                    "x": 854,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                }
                            ]
                        },
                        {
                            "name": "交换机",
                            "type": "9",
                            "id": 50,
                            "x": "-63",
                            "y": "0",
                            "z": "592",
                            "children": [{
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 51,
                                    "x": -103,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 52,
                                    "x": -78,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 53,
                                    "x": -53,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 54,
                                    "x": -28,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                }
                            ]
                        },
                        {
                            "name": "交换机",
                            "type": "9",
                            "id": 55,
                            "x": "-189",
                            "y": "0",
                            "z": "592",
                            "children": [{
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 56,
                                    "x": -229,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 57,
                                    "x": -204,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 58,
                                    "x": -179,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 59,
                                    "x": -154,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                }
                            ]
                        },
                        {
                            "name": "交换机",
                            "type": "9",
                            "id": 60,
                            "x": "-315",
                            "y": "0",
                            "z": "592",
                            "children": [{
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 61,
                                    "x": -355,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 62,
                                    "x": -330,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 63,
                                    "x": -305,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 64,
                                    "x": -280,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                }
                            ]
                        },
                        {
                            "name": "交换机",
                            "type": "9",
                            "id": 65,
                            "x": "-441",
                            "y": "0",
                            "z": "592",
                            "children": [{
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 66,
                                    "x": -481,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 67,
                                    "x": -456,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 68,
                                    "x": -431,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 69,
                                    "x": -406,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                }
                            ]
                        },
                        {
                            "name": "交换机",
                            "type": "9",
                            "id": 70,
                            "x": "-567",
                            "y": "0",
                            "z": "592",
                            "children": [{
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 71,
                                    "x": -607,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 72,
                                    "x": -582,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 73,
                                    "x": -557,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 74,
                                    "x": -532,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                }
                            ]
                        },
                        {
                            "name": "交换机",
                            "type": "9",
                            "id": 75,
                            "x": "-693",
                            "y": "0",
                            "z": "592",
                            "children": [{
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 76,
                                    "x": -733,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 77,
                                    "x": -708,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 78,
                                    "x": -683,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 79,
                                    "x": -658,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                }
                            ]
                        },
                        {
                            "name": "交换机",
                            "type": "9",
                            "id": 80,
                            "x": "-819",
                            "y": "0",
                            "z": "592",
                            "children": [{
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 81,
                                    "x": -859,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 82,
                                    "x": -834,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 83,
                                    "x": -809,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 84,
                                    "x": -784,
                                    "y": "0",
                                    "z": 692,
                                    "children": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "普通路由器",
                    "type": "10",
                    "id": 85,
                    "x": "0",
                    "y": "0",
                    "z": "-147",
                    "children": [{
                            "name": "交换机",
                            "type": "9",
                            "id": 86,
                            "x": "63",
                            "y": "0",
                            "z": "-592",
                            "children": [{
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 87,
                                    "x": 23,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 88,
                                    "x": 48,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 89,
                                    "x": 73,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 90,
                                    "x": 98,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                }
                            ]
                        },
                        {
                            "name": "交换机",
                            "type": "9",
                            "id": 91,
                            "x": "189",
                            "y": "0",
                            "z": "-592",
                            "children": [{
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 92,
                                    "x": 149,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 93,
                                    "x": 174,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 94,
                                    "x": 199,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 95,
                                    "x": 224,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                }
                            ]
                        },
                        {
                            "name": "交换机",
                            "type": "9",
                            "id": 96,
                            "x": "315",
                            "y": "0",
                            "z": "-592",
                            "children": [{
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 97,
                                    "x": 275,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 98,
                                    "x": 300,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 99,
                                    "x": 325,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 100,
                                    "x": 350,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                }
                            ]
                        },
                        {
                            "name": "交换机",
                            "type": "9",
                            "id": 101,
                            "x": "441",
                            "y": "0",
                            "z": "-592",
                            "children": [{
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 102,
                                    "x": 401,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 103,
                                    "x": 426,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 104,
                                    "x": 451,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 105,
                                    "x": 476,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                }
                            ]
                        },
                        {
                            "name": "交换机",
                            "type": "9",
                            "id": 106,
                            "x": "567",
                            "y": "0",
                            "z": "-592",
                            "children": [{
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 107,
                                    "x": 527,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 108,
                                    "x": 552,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 109,
                                    "x": 577,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 110,
                                    "x": 602,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                }
                            ]
                        },
                        {
                            "name": "交换机",
                            "type": "9",
                            "id": 111,
                            "x": "693",
                            "y": "0",
                            "z": "-592",
                            "children": [{
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 112,
                                    "x": 653,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 113,
                                    "x": 678,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 114,
                                    "x": 703,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 115,
                                    "x": 728,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                }
                            ]
                        },
                        {
                            "name": "交换机",
                            "type": "9",
                            "id": 116,
                            "x": "819",
                            "y": "0",
                            "z": "-592",
                            "children": [{
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 117,
                                    "x": 779,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 118,
                                    "x": 804,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 119,
                                    "x": 829,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 120,
                                    "x": 854,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                }
                            ]
                        },
                        {
                            "name": "交换机",
                            "type": "9",
                            "id": 121,
                            "x": "-63",
                            "y": "0",
                            "z": "-592",
                            "children": [{
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 122,
                                    "x": -103,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 123,
                                    "x": -78,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 124,
                                    "x": -53,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 125,
                                    "x": -28,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                }
                            ]
                        },
                        {
                            "name": "交换机",
                            "type": "9",
                            "id": 126,
                            "x": "-189",
                            "y": "0",
                            "z": "-592",
                            "children": [{
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 127,
                                    "x": -229,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 128,
                                    "x": -204,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 129,
                                    "x": -179,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 130,
                                    "x": -154,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                }
                            ]
                        },
                        {
                            "name": "交换机",
                            "type": "9",
                            "id": 131,
                            "x": "-315",
                            "y": "0",
                            "z": "-592",
                            "children": [{
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 132,
                                    "x": -355,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 133,
                                    "x": -330,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 134,
                                    "x": -305,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 135,
                                    "x": -280,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                }
                            ]
                        },
                        {
                            "name": "交换机",
                            "type": "9",
                            "id": 136,
                            "x": "-441",
                            "y": "0",
                            "z": "-592",
                            "children": [{
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 137,
                                    "x": -481,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 138,
                                    "x": -456,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 139,
                                    "x": -431,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 140,
                                    "x": -406,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                }
                            ]
                        },
                        {
                            "name": "交换机",
                            "type": "9",
                            "id": 141,
                            "x": "-567",
                            "y": "0",
                            "z": "-592",
                            "children": [{
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 142,
                                    "x": -607,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 143,
                                    "x": -582,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 144,
                                    "x": -557,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 145,
                                    "x": -532,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                }
                            ]
                        },
                        {
                            "name": "交换机",
                            "type": "9",
                            "id": 146,
                            "x": "-693",
                            "y": "0",
                            "z": "-592",
                            "children": [{
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 147,
                                    "x": -733,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 148,
                                    "x": -708,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 149,
                                    "x": -683,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 150,
                                    "x": -658,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                }
                            ]
                        },
                        {
                            "name": "交换机",
                            "type": "9",
                            "id": 151,
                            "x": "-819",
                            "y": "0",
                            "z": "-592",
                            "children": [{
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 152,
                                    "x": -859,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 153,
                                    "x": -834,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 154,
                                    "x": -809,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                },
                                {
                                    "name": "选手主机",
                                    "type": 1,
                                    "id": 155,
                                    "x": -784,
                                    "y": "0",
                                    "z": -692,
                                    "children": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "队伍",
            "type": "11",
            "id": 156,
            "x": "0",
            "y": "0",
            "z": "0",
            "children": [],
            "img": "1.png"
        },
        {
            "name": "队伍",
            "type": "11",
            "id": 157,
            "x": "0",
            "y": "0",
            "z": "0",
            "children": [],
            "img": "2.png"
        },
        {
            "name": "队伍",
            "type": "11",
            "id": 158,
            "x": "0",
            "y": "0",
            "z": "0",
            "children": [],
            "img": "3.png"
        },
        {
            "name": "队伍",
            "type": "11",
            "id": 159,
            "x": "0",
            "y": "0",
            "z": "0",
            "children": [],
            "img": "4.png"
        },
        {
            "name": "队伍",
            "type": "11",
            "id": 160,
            "x": "0",
            "y": "0",
            "z": "0",
            "children": [],
            "img": "5.png"
        },
        {
            "name": "队伍",
            "type": "11",
            "id": 161,
            "x": "0",
            "y": "0",
            "z": "0",
            "children": [],
            "img": "6.png"
        },
        {
            "name": "队伍",
            "type": "11",
            "id": 162,
            "x": "0",
            "y": "0",
            "z": "0",
            "children": [],
            "img": "7.png"
        },
        {
            "name": "队伍",
            "type": "11",
            "id": 163,
            "x": "0",
            "y": "0",
            "z": "0",
            "children": [],
            "img": "8.png"
        },
        {
            "name": "队伍",
            "type": "11",
            "id": 164,
            "x": "0",
            "y": "0",
            "z": "0",
            "children": [],
            "img": "9.png"
        },
        {
            "name": "队伍",
            "type": "11",
            "id": 165,
            "x": "0",
            "y": "0",
            "z": "0",
            "children": [],
            "img": "10.png"
        },
        {
            "name": "队伍",
            "type": "11",
            "id": 166,
            "x": "0",
            "y": "0",
            "z": "0",
            "children": [],
            "img": "11.png"
        },
        {
            "name": "队伍",
            "type": "11",
            "id": 167,
            "x": "0",
            "y": "0",
            "z": "0",
            "children": [],
            "img": "12.png"
        },
        {
            "name": "队伍",
            "type": "11",
            "id": 168,
            "x": "0",
            "y": "0",
            "z": "0",
            "children": [],
            "img": "13.png"
        },
        {
            "name": "队伍",
            "type": "11",
            "id": 169,
            "x": "0",
            "y": "0",
            "z": "0",
            "children": [],
            "img": "14.png"
        },
        {
            "name": "队伍",
            "type": "11",
            "id": 170,
            "x": "0",
            "y": "0",
            "z": "0",
            "children": [],
            "img": "15.png"
        },
        {
            "name": "队伍",
            "type": "11",
            "id": 171,
            "x": "0",
            "y": "0",
            "z": "0",
            "children": [],
            "img": "16.png"
        },
        {
            "name": "队伍",
            "type": "11",
            "id": 172,
            "x": "0",
            "y": "0",
            "z": "0",
            "children": [],
            "img": "17.png"
        },
        {
            "name": "队伍",
            "type": "11",
            "id": 173,
            "x": "0",
            "y": "0",
            "z": "0",
            "children": [],
            "img": "18.png"
        },
        {
            "name": "队伍",
            "type": "11",
            "id": 174,
            "x": "0",
            "y": "0",
            "z": "0",
            "children": [],
            "img": "19.png"
        },
        {
            "name": "队伍",
            "type": "11",
            "id": 175,
            "x": "0",
            "y": "0",
            "z": "0",
            "children": [],
            "img": "20.png"
        },
        {
            "name": "队伍",
            "type": "11",
            "id": 176,
            "x": "0",
            "y": "0",
            "z": "0",
            "children": [],
            "img": "21.png"
        },
        {
            "name": "队伍",
            "type": "11",
            "id": 177,
            "x": "0",
            "y": "0",
            "z": "0",
            "children": [],
            "img": "22.png"
        },
        {
            "name": "队伍",
            "type": "11",
            "id": 178,
            "x": "0",
            "y": "0",
            "z": "0",
            "children": [],
            "img": "23.png"
        },
        {
            "name": "队伍",
            "type": "11",
            "id": 179,
            "x": "0",
            "y": "0",
            "z": "0",
            "children": [],
            "img": "24.png"
        },
        {
            "name": "队伍",
            "type": "11",
            "id": 180,
            "x": "0",
            "y": "0",
            "z": "0",
            "children": [],
            "img": "25.png"
        },
        {
            "name": "队伍",
            "type": "11",
            "id": 181,
            "x": "0",
            "y": "0",
            "z": "0",
            "children": [],
            "img": "26.png"
        },
        {
            "name": "队伍",
            "type": "11",
            "id": 182,
            "x": "0",
            "y": "0",
            "z": "0",
            "children": [],
            "img": "27.png"
        },
        {
            "name": "队伍",
            "type": "11",
            "id": 183,
            "x": "0",
            "y": "0",
            "z": "0",
            "children": [],
            "img": "28.png"
        },
        {
            "x": "63",
            "y": "0",
            "z": 772,
            "name": "213",
            "type": "11",
            "id": 185,
            "info": "1.png",
            "children": []
        },
        {
            "x": "189",
            "y": "0",
            "z": 772,
            "name": "213",
            "type": "11",
            "id": 186,
            "info": "2.png",
            "children": []
        },
        {
            "x": "441",
            "y": "0",
            "z": 772,
            "name": "213",
            "type": "11",
            "id": 187,
            "info": "3.png",
            "children": []
        },
        {
            "x": "315",
            "y": "0",
            "z": 772,
            "name": "213",
            "type": "11",
            "id": 188,
            "info": "4.png",
            "children": []
        },
        {
            "x": "567",
            "y": "0",
            "z": 772,
            "name": "213",
            "type": "11",
            "id": 189,
            "info": "5.png",
            "children": []
        },
        {
            "x": "693",
            "y": "0",
            "z": 772,
            "name": "213",
            "type": "11",
            "id": 190,
            "info": "6.png",
            "children": []
        },
        {
            "x": "819",
            "y": "0",
            "z": 772,
            "name": "213",
            "type": "11",
            "id": 191,
            "info": "7.png",
            "children": []
        },
        {
            "x": "-63",
            "y": "0",
            "z": 772,
            "name": "213",
            "type": "11",
            "id": 192,
            "info": "8.png",
            "children": []
        },
        {
            "x": "-189",
            "y": "0",
            "z": 772,
            "name": "213",
            "type": "11",
            "id": 193,
            "info": "9.png",
            "children": []
        },
        {
            "x": "-315",
            "y": "0",
            "z": 772,
            "name": "213",
            "type": "11",
            "id": 194,
            "info": "10.png",
            "children": []
        },
        {
            "x": "-441",
            "y": "0",
            "z": 772,
            "name": "213",
            "type": "11",
            "id": 195,
            "info": "11.png",
            "children": []
        },
        {
            "x": "-567",
            "y": "0",
            "z": 772,
            "name": "213",
            "type": "11",
            "id": 196,
            "info": "12.png",
            "children": []
        },
        {
            "x": "-693",
            "y": "0",
            "z": 772,
            "name": "213",
            "type": "11",
            "id": 197,
            "info": "13.png",
            "children": []
        },
        {
            "x": "-819",
            "y": "0",
            "z": 772,
            "name": "213",
            "type": "11",
            "id": 198,
            "info": "14.png",
            "children": []
        },
        {
            "x": "63",
            "y": "0",
            "z": -772,
            "name": "213",
            "type": "11",
            "id": 199,
            "info": "15.png",
            "children": []
        },
        {
            "x": "189",
            "y": "0",
            "z": -772,
            "name": "213",
            "type": "11",
            "id": 200,
            "info": "16.png",
            "children": []
        },
        {
            "x": "315",
            "y": "0",
            "z": -772,
            "name": "213",
            "type": "11",
            "id": 201,
            "info": "17.png",
            "children": []
        },
        {
            "x": "441",
            "y": "0",
            "z": -772,
            "name": "213",
            "type": "11",
            "id": 202,
            "info": "18.png",
            "children": []
        },
        {
            "x": "567",
            "y": "0",
            "z": -772,
            "name": "213",
            "type": "11",
            "id": 203,
            "info": "19.png",
            "children": []
        },
        {
            "x": "693",
            "y": "0",
            "z": -772,
            "name": "213",
            "type": "11",
            "id": 204,
            "info": "20.png",
            "children": []
        },
        {
            "x": "819",
            "y": "0",
            "z": -772,
            "name": "213",
            "type": "11",
            "id": 205,
            "info": "21.png",
            "children": []
        },
        {
            "x": "-63",
            "y": "0",
            "z": -772,
            "name": "213",
            "type": "11",
            "id": 206,
            "info": "22.png",
            "children": []
        },
        {
            "x": "-189",
            "y": "0",
            "z": -772,
            "name": "213",
            "type": "11",
            "id": 207,
            "info": "23.png",
            "children": []
        },
        {
            "x": "-315",
            "y": "0",
            "z": -772,
            "name": "213",
            "type": "11",
            "id": 208,
            "info": "24.png",
            "children": []
        },
        {
            "x": "-441",
            "y": "0",
            "z": -772,
            "name": "213",
            "type": "11",
            "id": 209,
            "info": "25.png",
            "children": []
        },
        {
            "x": "-567",
            "y": "0",
            "z": -772,
            "name": "213",
            "type": "11",
            "id": 210,
            "info": "26.png",
            "children": []
        },
        {
            "x": "-693",
            "y": "0",
            "z": -772,
            "name": "213",
            "type": "11",
            "id": 211,
            "info": "27.png",
            "children": []
        },
        {
            "x": "-819",
            "y": "0",
            "z": -772,
            "name": "213",
            "type": "11",
            "id": 212,
            "info": "28.png",
            "children": []
        },
        {
            "x": "0",
            "y": "-1",
            "z": "720",
            "name": "213",
            "type": "12",
            "id": 213,
            "info": "ccccc_1.png,1880,330,选手区,1",
            "children": []
        },
        {
            "x": "0",
            "y": "-1",
            "z": "-720",
            "name": "213",
            "type": "12",
            "id": 214,
            "info": "ccccc_1.png,1880,330,选手区,1",
            "children": []
        },
        {
            "x": "558",
            "y": "-1",
            "z": "-7",
            "name": "213",
            "type": "12",
            "id": 215,
            "info": "mini_2.png,420,350,白盒测试区,1",
            "children": []
        },
        {
            "x": "-558",
            "y": "-1",
            "z": "-7",
            "name": "213",
            "type": "12",
            "id": 216,
            "info": "mini_2.png,420,350,黑盒测试区,1",
            "children": []
        }
    ],
    "links": [{
            "src": {
                "id": 1,
                "x": "0",
                "y": "0",
                "z": "0"
            },
            "dst": {
                "id": 2,
                "x": "-280",
                "y": "0",
                "z": "0"
            }
        },
        {
            "src": {
                "id": 1,
                "x": "0",
                "y": "0",
                "z": "0"
            },
            "dst": {
                "id": 9,
                "x": "280",
                "y": "0",
                "z": "0"
            }
        },
        {
            "src": {
                "id": 1,
                "x": "0",
                "y": "0",
                "z": "0"
            },
            "dst": {
                "id": 14,
                "x": "0",
                "y": "0",
                "z": "147"
            }
        },
        {
            "src": {
                "id": 1,
                "x": "0",
                "y": "0",
                "z": "0"
            },
            "dst": {
                "id": 85,
                "x": "0",
                "y": "0",
                "z": "-147"
            }
        },
        {
            "src": {
                "id": 2,
                "x": "-280",
                "y": "0",
                "z": "0"
            },
            "dst": {
                "id": 3,
                "x": "-680",
                "y": "0",
                "z": "-108"
            }
        },
        {
            "src": {
                "id": 2,
                "x": "-280",
                "y": "0",
                "z": "0"
            },
            "dst": {
                "id": 4,
                "x": "-550",
                "y": "0",
                "z": "-108"
            }
        },
        {
            "src": {
                "id": 2,
                "x": "-280",
                "y": "0",
                "z": "0"
            },
            "dst": {
                "id": 5,
                "x": "-420",
                "y": "0",
                "z": "-108"
            }
        },
        {
            "src": {
                "id": 2,
                "x": "-280",
                "y": "0",
                "z": "0"
            },
            "dst": {
                "id": 6,
                "x": "-680",
                "y": "0",
                "z": "108"
            }
        },
        {
            "src": {
                "id": 2,
                "x": "-280",
                "y": "0",
                "z": "0"
            },
            "dst": {
                "id": 7,
                "x": "-550",
                "y": "0",
                "z": "108"
            }
        },
        {
            "src": {
                "id": 2,
                "x": "-280",
                "y": "0",
                "z": "0"
            },
            "dst": {
                "id": 8,
                "x": "-420",
                "y": "0",
                "z": "108"
            }
        },
        {
            "src": {
                "id": 9,
                "x": "280",
                "y": "0",
                "z": "0"
            },
            "dst": {
                "id": 10,
                "x": "450",
                "y": "0",
                "z": "-108"
            }
        },
        {
            "src": {
                "id": 9,
                "x": "280",
                "y": "0",
                "z": "0"
            },
            "dst": {
                "id": 11,
                "x": "655",
                "y": "0",
                "z": "-108"
            }
        },
        {
            "src": {
                "id": 9,
                "x": "280",
                "y": "0",
                "z": "0"
            },
            "dst": {
                "id": 12,
                "x": "450",
                "y": "0",
                "z": "108"
            }
        },
        {
            "src": {
                "id": 9,
                "x": "280",
                "y": "0",
                "z": "0"
            },
            "dst": {
                "id": 13,
                "x": "655",
                "y": "0",
                "z": "108"
            }
        },
        {
            "src": {
                "id": 14,
                "x": "0",
                "y": "0",
                "z": "147"
            },
            "dst": {
                "id": 15,
                "x": "63",
                "y": "0",
                "z": "592"
            }
        },
        {
            "src": {
                "id": 15,
                "x": "63",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 16,
                "x": 23,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 15,
                "x": "63",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 17,
                "x": 48,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 15,
                "x": "63",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 18,
                "x": 73,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 15,
                "x": "63",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 19,
                "x": 98,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 14,
                "x": "0",
                "y": "0",
                "z": "147"
            },
            "dst": {
                "id": 20,
                "x": "189",
                "y": "0",
                "z": "592"
            }
        },
        {
            "src": {
                "id": 20,
                "x": "189",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 21,
                "x": 149,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 20,
                "x": "189",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 22,
                "x": 174,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 20,
                "x": "189",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 23,
                "x": 199,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 20,
                "x": "189",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 24,
                "x": 224,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 14,
                "x": "0",
                "y": "0",
                "z": "147"
            },
            "dst": {
                "id": 25,
                "x": "441",
                "y": "0",
                "z": "592"
            }
        },
        {
            "src": {
                "id": 25,
                "x": "441",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 26,
                "x": 401,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 25,
                "x": "441",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 27,
                "x": 426,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 25,
                "x": "441",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 28,
                "x": 451,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 25,
                "x": "441",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 29,
                "x": 476,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 14,
                "x": "0",
                "y": "0",
                "z": "147"
            },
            "dst": {
                "id": 30,
                "x": "315",
                "y": "0",
                "z": "592"
            }
        },
        {
            "src": {
                "id": 30,
                "x": "315",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 31,
                "x": 275,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 30,
                "x": "315",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 32,
                "x": 300,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 30,
                "x": "315",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 33,
                "x": 325,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 30,
                "x": "315",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 34,
                "x": 350,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 14,
                "x": "0",
                "y": "0",
                "z": "147"
            },
            "dst": {
                "id": 35,
                "x": "567",
                "y": "0",
                "z": "592"
            }
        },
        {
            "src": {
                "id": 35,
                "x": "567",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 36,
                "x": 527,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 35,
                "x": "567",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 37,
                "x": 552,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 35,
                "x": "567",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 38,
                "x": 577,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 35,
                "x": "567",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 39,
                "x": 602,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 14,
                "x": "0",
                "y": "0",
                "z": "147"
            },
            "dst": {
                "id": 40,
                "x": "693",
                "y": "0",
                "z": "592"
            }
        },
        {
            "src": {
                "id": 40,
                "x": "693",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 41,
                "x": 653,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 40,
                "x": "693",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 42,
                "x": 678,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 40,
                "x": "693",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 43,
                "x": 703,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 40,
                "x": "693",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 44,
                "x": 728,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 14,
                "x": "0",
                "y": "0",
                "z": "147"
            },
            "dst": {
                "id": 45,
                "x": "819",
                "y": "0",
                "z": "592"
            }
        },
        {
            "src": {
                "id": 45,
                "x": "819",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 46,
                "x": 779,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 45,
                "x": "819",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 47,
                "x": 804,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 45,
                "x": "819",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 48,
                "x": 829,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 45,
                "x": "819",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 49,
                "x": 854,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 14,
                "x": "0",
                "y": "0",
                "z": "147"
            },
            "dst": {
                "id": 50,
                "x": "-63",
                "y": "0",
                "z": "592"
            }
        },
        {
            "src": {
                "id": 50,
                "x": "-63",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 51,
                "x": -103,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 50,
                "x": "-63",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 52,
                "x": -78,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 50,
                "x": "-63",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 53,
                "x": -53,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 50,
                "x": "-63",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 54,
                "x": -28,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 14,
                "x": "0",
                "y": "0",
                "z": "147"
            },
            "dst": {
                "id": 55,
                "x": "-189",
                "y": "0",
                "z": "592"
            }
        },
        {
            "src": {
                "id": 55,
                "x": "-189",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 56,
                "x": -229,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 55,
                "x": "-189",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 57,
                "x": -204,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 55,
                "x": "-189",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 58,
                "x": -179,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 55,
                "x": "-189",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 59,
                "x": -154,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 14,
                "x": "0",
                "y": "0",
                "z": "147"
            },
            "dst": {
                "id": 60,
                "x": "-315",
                "y": "0",
                "z": "592"
            }
        },
        {
            "src": {
                "id": 60,
                "x": "-315",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 61,
                "x": -355,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 60,
                "x": "-315",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 62,
                "x": -330,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 60,
                "x": "-315",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 63,
                "x": -305,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 60,
                "x": "-315",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 64,
                "x": -280,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 14,
                "x": "0",
                "y": "0",
                "z": "147"
            },
            "dst": {
                "id": 65,
                "x": "-441",
                "y": "0",
                "z": "592"
            }
        },
        {
            "src": {
                "id": 65,
                "x": "-441",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 66,
                "x": -481,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 65,
                "x": "-441",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 67,
                "x": -456,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 65,
                "x": "-441",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 68,
                "x": -431,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 65,
                "x": "-441",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 69,
                "x": -406,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 14,
                "x": "0",
                "y": "0",
                "z": "147"
            },
            "dst": {
                "id": 70,
                "x": "-567",
                "y": "0",
                "z": "592"
            }
        },
        {
            "src": {
                "id": 70,
                "x": "-567",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 71,
                "x": -607,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 70,
                "x": "-567",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 72,
                "x": -582,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 70,
                "x": "-567",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 73,
                "x": -557,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 70,
                "x": "-567",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 74,
                "x": -532,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 14,
                "x": "0",
                "y": "0",
                "z": "147"
            },
            "dst": {
                "id": 75,
                "x": "-693",
                "y": "0",
                "z": "592"
            }
        },
        {
            "src": {
                "id": 75,
                "x": "-693",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 76,
                "x": -733,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 75,
                "x": "-693",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 77,
                "x": -708,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 75,
                "x": "-693",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 78,
                "x": -683,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 75,
                "x": "-693",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 79,
                "x": -658,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 14,
                "x": "0",
                "y": "0",
                "z": "147"
            },
            "dst": {
                "id": 80,
                "x": "-819",
                "y": "0",
                "z": "592"
            }
        },
        {
            "src": {
                "id": 80,
                "x": "-819",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 81,
                "x": -859,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 80,
                "x": "-819",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 82,
                "x": -834,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 80,
                "x": "-819",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 83,
                "x": -809,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 80,
                "x": "-819",
                "y": "0",
                "z": "592"
            },
            "dst": {
                "id": 84,
                "x": -784,
                "y": "0",
                "z": 692
            }
        },
        {
            "src": {
                "id": 85,
                "x": "0",
                "y": "0",
                "z": "-147"
            },
            "dst": {
                "id": 86,
                "x": "63",
                "y": "0",
                "z": "-592"
            }
        },
        {
            "src": {
                "id": 86,
                "x": "63",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 87,
                "x": 23,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 86,
                "x": "63",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 88,
                "x": 48,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 86,
                "x": "63",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 89,
                "x": 73,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 86,
                "x": "63",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 90,
                "x": 98,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 85,
                "x": "0",
                "y": "0",
                "z": "-147"
            },
            "dst": {
                "id": 91,
                "x": "189",
                "y": "0",
                "z": "-592"
            }
        },
        {
            "src": {
                "id": 91,
                "x": "189",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 92,
                "x": 149,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 91,
                "x": "189",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 93,
                "x": 174,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 91,
                "x": "189",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 94,
                "x": 199,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 91,
                "x": "189",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 95,
                "x": 224,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 85,
                "x": "0",
                "y": "0",
                "z": "-147"
            },
            "dst": {
                "id": 96,
                "x": "315",
                "y": "0",
                "z": "-592"
            }
        },
        {
            "src": {
                "id": 96,
                "x": "315",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 97,
                "x": 275,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 96,
                "x": "315",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 98,
                "x": 300,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 96,
                "x": "315",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 99,
                "x": 325,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 96,
                "x": "315",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 100,
                "x": 350,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 85,
                "x": "0",
                "y": "0",
                "z": "-147"
            },
            "dst": {
                "id": 101,
                "x": "441",
                "y": "0",
                "z": "-592"
            }
        },
        {
            "src": {
                "id": 101,
                "x": "441",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 102,
                "x": 401,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 101,
                "x": "441",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 103,
                "x": 426,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 101,
                "x": "441",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 104,
                "x": 451,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 101,
                "x": "441",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 105,
                "x": 476,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 85,
                "x": "0",
                "y": "0",
                "z": "-147"
            },
            "dst": {
                "id": 106,
                "x": "567",
                "y": "0",
                "z": "-592"
            }
        },
        {
            "src": {
                "id": 106,
                "x": "567",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 107,
                "x": 527,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 106,
                "x": "567",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 108,
                "x": 552,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 106,
                "x": "567",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 109,
                "x": 577,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 106,
                "x": "567",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 110,
                "x": 602,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 85,
                "x": "0",
                "y": "0",
                "z": "-147"
            },
            "dst": {
                "id": 111,
                "x": "693",
                "y": "0",
                "z": "-592"
            }
        },
        {
            "src": {
                "id": 111,
                "x": "693",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 112,
                "x": 653,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 111,
                "x": "693",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 113,
                "x": 678,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 111,
                "x": "693",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 114,
                "x": 703,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 111,
                "x": "693",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 115,
                "x": 728,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 85,
                "x": "0",
                "y": "0",
                "z": "-147"
            },
            "dst": {
                "id": 116,
                "x": "819",
                "y": "0",
                "z": "-592"
            }
        },
        {
            "src": {
                "id": 116,
                "x": "819",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 117,
                "x": 779,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 116,
                "x": "819",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 118,
                "x": 804,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 116,
                "x": "819",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 119,
                "x": 829,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 116,
                "x": "819",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 120,
                "x": 854,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 85,
                "x": "0",
                "y": "0",
                "z": "-147"
            },
            "dst": {
                "id": 121,
                "x": "-63",
                "y": "0",
                "z": "-592"
            }
        },
        {
            "src": {
                "id": 121,
                "x": "-63",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 122,
                "x": -103,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 121,
                "x": "-63",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 123,
                "x": -78,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 121,
                "x": "-63",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 124,
                "x": -53,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 121,
                "x": "-63",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 125,
                "x": -28,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 85,
                "x": "0",
                "y": "0",
                "z": "-147"
            },
            "dst": {
                "id": 126,
                "x": "-189",
                "y": "0",
                "z": "-592"
            }
        },
        {
            "src": {
                "id": 126,
                "x": "-189",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 127,
                "x": -229,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 126,
                "x": "-189",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 128,
                "x": -204,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 126,
                "x": "-189",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 129,
                "x": -179,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 126,
                "x": "-189",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 130,
                "x": -154,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 85,
                "x": "0",
                "y": "0",
                "z": "-147"
            },
            "dst": {
                "id": 131,
                "x": "-315",
                "y": "0",
                "z": "-592"
            }
        },
        {
            "src": {
                "id": 131,
                "x": "-315",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 132,
                "x": -355,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 131,
                "x": "-315",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 133,
                "x": -330,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 131,
                "x": "-315",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 134,
                "x": -305,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 131,
                "x": "-315",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 135,
                "x": -280,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 85,
                "x": "0",
                "y": "0",
                "z": "-147"
            },
            "dst": {
                "id": 136,
                "x": "-441",
                "y": "0",
                "z": "-592"
            }
        },
        {
            "src": {
                "id": 136,
                "x": "-441",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 137,
                "x": -481,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 136,
                "x": "-441",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 138,
                "x": -456,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 136,
                "x": "-441",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 139,
                "x": -431,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 136,
                "x": "-441",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 140,
                "x": -406,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 85,
                "x": "0",
                "y": "0",
                "z": "-147"
            },
            "dst": {
                "id": 141,
                "x": "-567",
                "y": "0",
                "z": "-592"
            }
        },
        {
            "src": {
                "id": 141,
                "x": "-567",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 142,
                "x": -607,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 141,
                "x": "-567",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 143,
                "x": -582,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 141,
                "x": "-567",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 144,
                "x": -557,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 141,
                "x": "-567",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 145,
                "x": -532,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 85,
                "x": "0",
                "y": "0",
                "z": "-147"
            },
            "dst": {
                "id": 146,
                "x": "-693",
                "y": "0",
                "z": "-592"
            }
        },
        {
            "src": {
                "id": 146,
                "x": "-693",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 147,
                "x": -733,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 146,
                "x": "-693",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 148,
                "x": -708,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 146,
                "x": "-693",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 149,
                "x": -683,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 146,
                "x": "-693",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 150,
                "x": -658,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 85,
                "x": "0",
                "y": "0",
                "z": "-147"
            },
            "dst": {
                "id": 151,
                "x": "-819",
                "y": "0",
                "z": "-592"
            }
        },
        {
            "src": {
                "id": 151,
                "x": "-819",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 152,
                "x": -859,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 151,
                "x": "-819",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 153,
                "x": -834,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 151,
                "x": "-819",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 154,
                "x": -809,
                "y": "0",
                "z": -692
            }
        },
        {
            "src": {
                "id": 151,
                "x": "-819",
                "y": "0",
                "z": "-592"
            },
            "dst": {
                "id": 155,
                "x": -784,
                "y": "0",
                "z": -692
            }
        }
    ]
}